src/test/resources/web/services/nsiv2/querySummary.xml

<soapenv:Envelope
        xmlns:type="http://schemas.ogf.org/nsi/2013/12/connection/types" xmlns:head="http://schemas.ogf.org/nsi/2013/12/framework/headers" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <head:nsiHeader>
            <protocolVersion>application/vnd.ogf.nsi.cs.v2.provider+soap</protocolVersion>
            <correlationId>urn:uuid:926aad30-eed9-4106-9354-51520a2e83c9</correlationId>
            <requesterNSA>urn:ogf:network:nsa:surfnet-nsi-requester</requesterNSA>
            <providerNSA>urn:ogf:network:surfnet.nl:1990:nsa:bod-dev</providerNSA>
            <replyTo>http://localhost:9000/reply</replyTo>
        </head:nsiHeader>
    </soapenv:Header>
    <soapenv:Body>
        <type:querySummary> </type:querySummary>
    </soapenv:Body>
</soapenv:Envelope>